---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ClearOpenings
source: html/a72eec8f-83c7-c53c-04fd-c49650c3c20d.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ClearOpenings Method

Removes all cached openings from the data.

## Syntax (C#)
```csharp
public void ClearOpenings()
```